#pragma once
#include <vector>

using namespace std;

enum MatrixType { a, b, c, d, e, f, g, h, i, j, };

class Data
{
private:
    MatrixType matrixType;

public:
    explicit Data(const MatrixType type) : matrixType(type) {}

    [[nodiscard]] const vector<vector<double>>& getMatrix() const
    {
        switch (matrixType)
        {
        case a: return MatrixA;
        case b: return MatrixB;
        case c: return MatrixC;
        case d: return MatrixD;
        case e: return MatrixE;
        case f: return MatrixF;
        case g: return MatrixG;
        case h: return MatrixH;
        case i: return MatrixI;
        case j: return MatrixJ;
        }

        // На случай некорректного значения enum
        throw invalid_argument("Неизвестный тип матрицы.");
    }

private:
    /// ИСХОДНАЯ МАТРИЦА
    vector<vector<double>> MatrixA = {
        {1, 2},
        {3, 4}
    };

    vector<vector<double>> MatrixB = {
        {1, 0, 0},
        {0, 1, 0},
        {0, 0, 1}
    };

    /// НЕ ПРОЙДЕН ГРАММОМ-ШМИДТОМ
    vector<vector<double>> MatrixC = {
        {1, 2},
        {2, 4}
    };

    /// НЕ ПРОЙДЕН ГРАММОМ-ШМИДТОМ
    vector<vector<double>> MatrixD = {
        {1, 1},
        {1, 1.000000000001}
    };

    /// НЕ ПРОЙДЕН ГРАММОМ-ШМИДТОМ
    vector<vector<double>> MatrixE = {
        {1, 0},
        {0, 0}
    };

    vector<vector<double>> MatrixF = {
        {1, 1, 1, 1},
        {1, 1.000001, 1, 1.000002},
        {1, 1, 1.000001, 1.000003},
        {1, 1.000002, 1.000002, 1.000004},
        {1, 1.000003, 1.000003, 1.000005}
    };

    vector<vector<double>> MatrixG = {
        {1000000000000, 1, 0.000000000001, 3},
        {2, 100000000, 1, 0.0000000001},
        {0.00001, 4, 10000, 1},
        {7, 0.0000001, 2, 100}
    };

    /// НЕ ПРОЙДЕН ГРАММОМ-ШМИДТОМ
    vector<vector<double>> MatrixH = {
        {1, 2, 3, 4, 5},
        {2, 4, 6, 8, 10},
        {3, 6, 9, 12, 15},
        {4, 8, 12, 16, 20},
        {5, 10, 15, 20, 25},
        {1, 2, 3, 4, 5.0000000001}
    };

    vector<vector<double>> MatrixJ = {
        {1, 1, 1.000001},
        {2, 2.000001, 2.000002},
        {3, 3, 3.000003},
        {4, 4.000001, 4.000004},
        {5, 5, 5.000005},
        {6, 6.000001, 6.000006},
        {7, 7, 7.000007},
        {8, 8.000001, 8.000008}
    };

    vector<vector<double>> MatrixI = {
        {1, 0.5, 0.3333333333333333, 0.25, 0.2, 0.1666666666666667, 0.1428571428571429, 0.125},
        {0.5, 0.3333333333333333, 0.25, 0.2, 0.1666666666666667, 0.1428571428571429, 0.125, 0.1111111111111111},
        {0.3333333333333333, 0.25, 0.2, 0.1666666666666667, 0.1428571428571429, 0.125, 0.1111111111111111, 0.1},
        {0.25, 0.2, 0.1666666666666667, 0.1428571428571429, 0.125, 0.1111111111111111, 0.1, 0.0909090909090909},
        {
            0.2, 0.1666666666666667, 0.1428571428571429, 0.125, 0.1111111111111111, 0.1, 0.0909090909090909,
            0.0833333333333333
        },
        {
            0.1666666666666667, 0.1428571428571429, 0.125, 0.1111111111111111, 0.1, 0.0909090909090909,
            0.0833333333333333, 0.0769230769230769
        },
        {
            0.1428571428571429, 0.125, 0.1111111111111111, 0.1, 0.0909090909090909, 0.0833333333333333,
            0.0769230769230769, 0.0714285714285714
        },
        {
            0.125, 0.1111111111111111, 0.1, 0.0909090909090909, 0.0833333333333333, 0.0769230769230769,
            0.0714285714285714, 0.0666666666666667
        }
    };
};